tutorials/Plate2D/Allrun
#!/bin/sh

cp -r initial 0
blockMesh
setFields
laserbeamFoam
