tutorials/Plate2D/constant/LaserProperties
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  6
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "constant";
    object      PhaseFieldProperties;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //
V_incident	(0 1 0);//(0 1 0);//NORMALISED IN CODE

HS_a 0.0005;
HS_bg 0.0;//20
HS_velocity 0.0;//6.0;
HS_lg 3e-3;
HS_Q 2000.0;//

wavelength	1.064e-6;
e_num_density	5.83e29;
elec_resistivity	1.0e-6;

// Use local search: defaults to yes
//useLocalSearch yes;

// Print extra debug information: defaults to no
//debug no;
